using System;

namespace CODE_BLOG__12._2_Generic_Шаблон___с_ограничениями_
{
    class Program
    {
        static void Main(string[] args)
        {
            // Обобщения или шаблоны(Generic) в C# - Учим Шарп #12
            // Шаблоны (<T> template ) - это переменная для типа переменных. Говоря проще, везде пишем в типе переменной "T", тоесть
            // обобщенный тип переменной, тоесть мы пока не знаем какой тип нам нужен будет в последствии и потом указываем к
            // примеру тип "int" и везде где был тип "T" прописывается "int".

            var p = new Product("Яблоко", 100, 100);











        }
    }
}
